Repository: Daniel-KM/Omeka-S-module-Redirector
Catalog: language/*.po
Languages: fr

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module « %1$s » doit être mis à niveau à la version « %2$s » ou supérieure.

source: It is now possible to manage complex redirections with placeholders.
fr: Il est désormais possible de gérer des redirections complexes avec des jokers.

source: The advanced redirections are not a valid json. Check quotes, commas, escapes and backslash.
fr: Les redirections avancées ne sont pas un json valide. Vérifier les guillemets, les virgules, les échappements et les barres inverses.

source: [Redirector] Rights check failed for resource {resource_id}: {message}
fr: [Redirecteur] La vérification des droits a échoué pour la ressource {resource_id} : {message}

source: [Redirector] Page redirect failed for site "{site_slug}", page "{page_slug}": {message}
fr: [Redirecteur] La redirection de la page a échoué pour le site {site_slug}, page {page_slug} : {message}

source: Redirector
fr: Redirecteur

source: Simple redirections from any resource (id = page slug or url)
fr: Redirections simples des ressources (id = chemin de la page ou url)

source: Format: left part is a resource id; right part is a page slug or absolute/relative url.
fr: Format : la partie gauche est l’id de la ressource ; la partie droite est le chemin de la page ou l’url relative ou absolue.

source: Advanced redirections (JSON)
fr: Redirections avancées (json)

source: JSON: route or key => { "target": "...", "route": "site/page", "params": {...}, "query": {...}, "status": 302 }. Redirect is internal when status is not set.
fr: Json : route ou clé => { "target": "...", "route": "site/page", "params": {...}, "query": {...}, "status": 302 }. Redirige vers la page interne si le statut n’est pas indiqué.

source: Check rights to view resource before redirection
fr: Vérifier les droits de voir la ressource avant de rediriger

source: Value is not JSON.
fr: La valeur n’est pas json.

source: Malformed JSON string.
fr: Chaîne json malformée.

source: JSON must map keys to objects with at least a non-empty "target". Routes must be non-empty strings. No redirect loops allowed.
fr: Le json doit aliger des clées aux objets avec au moins une "target" non-vide. Les routes doivent être des chaînes non-vides. Les redirections multiples sont interdites.
